Fixed versions and PaymentAPI examples
